publish/programacion/notacion-ingenieria.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2021-08-24 mar 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notacion de ingenieria en python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="shortcut icon" type="image/jpg" href="../favicon.png"/>
<meta name="theme-color" content="#fff">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"/>
<div id="google_translate_element"></div></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Notacion de ingenieria en python
<br />
<span class="subtitle">Programación</span>
</h1>

<div id="outline-container-orgc57bfcf" class="outline-2">
<h2 id="orgc57bfcf">Introducción</h2>
<div class="outline-text-2" id="text-orgc57bfcf">
<p>
Sí has estado leyendo mi blog sabrás que actualmente me encuentro estudiando ingeniería y que me gustan las calculadoras mi favorita la <a href="https://www.casio-intl.com/latin/es/calc/products/fx-CG50/">CASIO fx-CG50</a>, esta calculadora cuenta con un intérprete de micro-python bastante limitado, pero con un poco de cabeza podemos explotar su máximo potencial.
</p>

<p>
<a href="https://github.com/Galindo-lab/calculator/blob/main/python/Sresiste.py">Código</a>
</p>
</div>
</div>

<div id="outline-container-org520dfc2" class="outline-2">
<h2 id="org520dfc2">Antecedente</h2>
<div class="outline-text-2" id="text-org520dfc2">
<p>
La <a href="../apuntes/notacion-ingenieria.html">notación de ingeniería</a> es una forma de abreviar números muy grandes, es parecida a la notación científica, pero su característica más notable es que usa letras para representar valores.
</p>
</div>
</div>

<div id="outline-container-org13c7083" class="outline-2">
<h2 id="org13c7083">Mi solucion</h2>
<div class="outline-text-2" id="text-org13c7083">
</div>
<div id="outline-container-org4e98791" class="outline-3">
<h3 id="org4e98791">Lookup table</h3>
<div class="outline-text-3" id="text-org4e98791">
<p>
La solucion más sencilla para los problemas es por lo general la mejor solucion y en este caso no fue la exepcion, una lookup-table para almacenar los exponentes es mas que suficiente:
</p>

<pre class="example">
_suffix_lookup = {
    'T': 1e12,
    'G': 1e9,
    'M': 1e6,
    'k': 1e3,
     '': 1e0,
    'm': 1e-3,
    'u': 1e-6,
    'n': 1e-9,
    'p': 1e-12,
    'f': 1e-15,
    'a': 1e-18,
}
</pre>
</div>
</div>

<div id="outline-container-orgd5fa1e4" class="outline-3">
<h3 id="orgd5fa1e4">Captura del numero</h3>
<div class="outline-text-3" id="text-orgd5fa1e4">
<p>
La solución más sencilla para los problemas es por lo general la mejor solución y en este caso no fue la excepción, una lookup-table para almacenar los exponentes es más que suficiente:
</p>
</div>

<div id="outline-container-org4def787" class="outline-4">
<h4 id="org4def787">Sencilla</h4>
<div class="outline-text-4" id="text-org4def787">
<p>
Solución con redundancia mínima, es más sencilla pero menos robusta:
</p>

<pre class="example">

def input_ing2():
    x = input().split();
    if len(x) &gt; 0:
        if len(x) &gt; 1 and x[1] in _suffix_lookup:
            return float(x[0]) * _suffix_lookup[x[1]]
        else:
            return float(x[0])
    else:
        return None

</pre>
</div>
</div>

<div id="outline-container-org80a7470" class="outline-4">
<h4 id="org80a7470">óptima</h4>
<div class="outline-text-4" id="text-org80a7470">
<p>
Solución óptima (en mi opinión), más compleja pero es más robusta
</p>

<pre class="example">

def input_ing(message=""):
    x = input(message).split();
    try:
        if len(x) &gt; 0:
            if len(x) &gt; 1 and x[1] in _suffix_lookup:
                return float(x[0]) * _suffix_lookup[x[1]]
            else:
                return float(x[0])
    except ValueError:
        print((
            "El valor ingresado\n"
            "no es valido, ej:\n"
            "       10 M \n"
            "debe llevar espacio"
        ))
        input()
    return None

</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
